class HomeScreenTexts {
  static const String navigationText = 'فوری جائزہ ';
}

class DescriptionScreenTexts {
  static const String navigationText = 'تفصیل';
  static const String title = 'تفصیل (Description)';
  static const String subTitle =
      'نشہ آوار اشیاء کے استعمال کےباعث  ہو نے والے امراض';
  static const List descriptions = [
    {
      "boldText": "",
      "normalText":
          "نشہ آور اشیاء کے استعمال کی وجہ سےہونے والے  امراض  میں دونوں منشیات اور شراب کے استعمال سے ہونےوالےامراض   کے ساتھ ، ان سےمنسلک کچھ حالتیں جس  میں شدید نشے کی حا لت(Acute Intoxication)، بہت زیادہ مقدار میں منشیات کا استعمال (Overdose)  اور  نشہ چھوڑنے کی صورت میں    ظاہر ہونے   والی  علامات (Withdrawal) شامل ہیں ۔"
    },
    {
      "boldText": "شدید نشے کی حالت  (Acute Intoxication) ",
      "normalText":
          " نشہ آور اشیاء کے استعمال کے بعد ایسی عارضی کیفیت جس کے  نتیجے میں ہوش و حواس اور احساسات کا  کھو  جانا،جذبات  یا رویوں  میں تبدیلی آنا شامل ہیں۔"
    },
    {
      "boldText": "زیادہ مقدار میں  نشے کا  استعمال  (Overdose) ",
      "normalText":
          "کسی بھی نشہ آور شے  کا اتنی مقدار میں استعمال کہ  اس سےشدید منفی جسمانی یا ذہنی اثرات  پیدا ہوں۔"
    },
    {
      "boldText":
          "نشہ چھوڑنے  کی صورت میں ظاہر ہونے والی علا مات (Withdrawal) ",
      "normalText":
          "یہ  نشہ لینے  کی مقدار میں اچانک رکاوٹ یا کمی کے بعد  ناخوشگوار علامات کا مجموعہ ہے۔ نشے کا زیادہ مقدار اور طویل دورانیے کا استمعال کیا جا ئے  تو وہ شخص جسمانی یا ذہنی طور پر اس  کا محتاج ہو جاتا ہے۔ بنیادی طور پر، جسم میں نشہ آور اشیاء  کی مقدار کم ہو نے یا نشہ چھوڑنے  کی صورت میں ظاہر ہونے والی علامات ، ان علامات کے  برعکس ہیں جو نشے   کے  استعمال کے نتیجےمیں  پیدا ہوتی ہیں۔ "
    },
    {
      "boldText": "نشہ آور اشیا کا نقصان دہ استعمال(Harmful Use) ",
      "normalText":
          "ایک  ایساطرز عمل جس سے ذہنی و جسمانی صحت کو نقصان پہنچتا ہے۔ مثلاً جگر کی بیماری، یا سلسلہ وار ڈیپریشن  ۔ یہ اکثر سماجی مسائل جیسے خاندا ن ، کام کاج  یا روزگار   کے مسائل سے منسلک  ہے  ۔"
    },
    {
      "boldText": 'نشہ آور اشیاء  پر انحصار (Dependence) ',
      "normalText":
          "جسمانی  طرزعمل ، رویہ ، اور ادراک کا ایسا  مجموعہ جس میں نشہ  آور  اشیا کا استعمال کسی فرد کے لیےان رویوں کے مقابلے میں بہت زیادہ اہمیت کا حامل ہو جاتا  ہے جوپہلے اس کے لئے  قابل قدر تھے۔ نشہ آور اشیاء کو استعمال کرنے کی شدید طلب اور استعمال پر اختیار کھو جانا اس کی  خصوصیت ہے۔"
    },
  ];
}

class FollowupScreenTexts {
  static const String navigationText = ' فالواپ';
  static const String title1 = 'رابطہ کی تعداد سے متعلق تجاویز';
  static const String subTitle1 = 'رابطہ کی تعداد سے متعلق تجاویز';
  static const List frequencyContactRecommendations = [
    {
      "boldText": " نقصان دہ استعمال:",
      "normalText":
          " ایک ماہ میں فالو اپ۔ اس کے بعد ضرورت کے مطابق فالو اپ کریں۔"
    },
    {
      "boldText": " انحصار:",
      "normalText":
          " پہلے دو ہفتوں میں ہر ہفتے کئی بار فالو اپ، پھر پہلے مہینے میں ہفتہ وار۔ ایک بار بہتر ہونے کے بعد، تعداد کو ماہانہ اور اس کے بعد ضرورت کے مطابق کم کریں۔"
    },
  ];
  static const String title2 = '1- بہتری کی جانچ کریں';
  static const String subTitle2 = 'بہتری کی جانچ کریں';
  static const List assessForImprovements = [
    {
      "heading": 'ہر وزٹ (visit) پر، جانچ کریں:',
      "bulletPoints": [
        {
          "text":
              '  نشہ کے استعمال کی مقدار اور تعداد، ذہنی صحت، جسمانی صحت، خطرے اور حفاظتی عناصر (مثلاً تعلقات، رہائش، ملازمت وغیرہ)۔'
        },
        {
          "text":
              ' ان عناصر کے بارے میں پوچھیں جو نشہ کے استعمال اور نتائج کا باعث بنتے ہیں۔'
        }
      ]
    },
    {
      "heading": 'نشہ  کا مسلسل استعمال:',
      "bulletPoints": [
        {
          "text":
              ' نشے کے استمعال کے نقصان کو کم کرنے کے لیے حکمت عملی تیار کریں۔'
        },
        {"text": '  صحت کے مسائل کا علاج کریں۔'},
        {"text": '   نشے کے استعمال کو کم کرنے کے لیے حکمت عملی تیار کریں۔'},
        {
          "text":
              '  اگر کلائنٹ راضی ہو تو  detoxification یا مینٹیننس ٹریٹمنٹ کا بندوبست کریں۔'
        },
        {"text": '  بار بار جائزہ لیں اور کمیونٹی میں جا کر کام کریں۔ '},
      ]
    },
    {
      "heading":
          'استعمال کو حال ہی میں روکنا یا غیر نقصان دہ استعمال میں تبدیلی:',
      "bulletPoints": [
        {
          "text":
              ' ابسٹیننس (abstinene) کی تصدیق کے لیے پیشاب کے ٹیسٹ پر غور کریں۔'
        },
        {
          "text":
              ' ابسٹیننس (abstinene) /غیر نقصان دہ استعمال کی بحالی کی حوصلہ افزائی کے لیے مثبت رائے دیں۔'
        },
        {"text": '  دیگر طبی مسائل کا علاج کریں۔'},
        {
          "text":
              '  شراب اور اوپیائیڈ پر انحصار کے لیے دوبارہ  استمعال سے بچاؤ کے لیے دی جانے  والی ادویات  پر غور کریں ۔'
        },
        {
          "text":
              '  دوبارہ استمعال سے بچاو کے لیے سائیکو سوشل تھراپی اور باہمی مدد کے گروپس پر غور کریں ۔'
        },
        {
          "text":
              ' معاون عنصر جو دوبارہ نشہ کی طرف جانے کے خطرے کو کم کرتے ہیں، مثلاً مکان اور روزگار۔'
        }
      ]
    },
    {
      "heading": 'طویل مدت کے لیے نشے سے پرہیز یا غیر نقصان دہ استعمال:',
      "bulletPoints": [
        {
          "text":
              ' نشہ کا استعمال  نہ کرنےکی تصدیق کے لیے کبھی کبھار پیشاب کا ٹیسٹ کرنے پر غور کریں'
        },
        {"text": ' مثبت فیڈبیک (feedback) دیں۔'},
        {
          "text":
              '  معاون عوامل جو دوبارہ نشہ کی طرف جانے کے خطرے کو کم کرتے ہیں، (مثلاً مکان اور روزگار۔)'
        },
        {"text": '  دوسرے طبی مسائل کا علاج کریں۔'},
        {"text": '  باہمی مدد کے گروپوں میں شرکت کی حوصلہ افزائی کریں'},
        {"text": ' کبھی کبھار جائزہ کریں۔'},
      ]
    },
  ];
}

class DiagnosisScreen {
  static const String navigationText = ' تشخیص(Assessment)';
  static const String title = 'تشخیص';
}

class EmergencyDiagnosisText {
  static const String navigationBarText =
      'ایمرجنسی صورت حال میں   نشہ کی تشخیص: \nکیا شدید نشہ کرنے یا نشہ چھوڑنے  کا شبہ ہے؟';
  static const String navigationText = 'ایمرجنسی';
  static const String titleRed = 'ہنگامی تشخیص:';
  static const String titleOrange =
      'کیا شدید نشہ کرنے یا نشہ چھوڑنے  کا شبہ ہے؟';
  static const bulletPoints = [
    'کیا شخص سکون آور اشیاء  کے زیرِ اثر  دکھائی دیتا ہے؟',
    'کیا شخص بہت زیادہ متحرک ، ذہنی طور پر پریشان ، یا بے چین  دکھائی دیتا ہے؟',
    'کیا شخص الجھن میں نظر آتا ہے؟'
  ];

  static const octagonalText =
      'نشہ آوراشیاء  کے استعمال کے با عث ہونے والے  امراض کی  ہنگامی نو عیت  ';
  static const emergencyBulletPoints = [
    {
      "boldText":
          "شراب  کے استعمال سے شدید نشے کی حالت (Alcohol intoxication): ",
      "normalText":
          "سانس میں شراب  کی بو، غیر واضح انداز  میں گفتگو ، بے قابو رویہ؛  ہوش و  حواس ، ، ادرک ، احساسات ، جذبات یا رویے میں خلل ۔",
    },
    {
      "boldText":
          "اوپیا ئیڈ (opioid) کی زیادہ مقدارلینے کے اثرات (Opioid Overdose): ",
      "normalText":
          "بالکل رد عمل نہ دینا یا بہت کم ردعمل ظاہر کرنا  ، سانس  لینے کی شرح میں کمی ، آنکھ کی پتلیوں کا سکڑجانا ۔",
    },
    {
      "boldText": " شراب یا دیگر سکون آور اشیاء (Sedatives)چھوڑنے  کے اثرات  :",
      "normalText":
          "ہاتھوں میں لرزش، پسینہ آنا، قے، نبض اور بلڈ پریشر میں اضافہ،بے چینی  ، سر درد، متلی، اضطراب /تشویش ؛ شدید صورتوں  میں جسم کو جھٹکے لگنا اورذہنی  الجھن کا شکار ہونا۔",
    },
    {
      "boldText":
          "Stimulant کے استعمال سے شدید نشے کی حالت (Stimulant Intoxication):",
      "normalText":
          "پھیلی ہوئی  پتلیاں ، پرجوش رویہ، تیز آنے والے خیالات، بے ترتیب سوچیں ، عجیب رویہ،  نشہ آور اشیاء کا حالیہ استعمال ، نبض اور بلڈ پریشر میں اضافہ، غصیلہ، بے ترتیب، یا پرتشددرویہ۔",
    },
    {
      "boldText": "نشہ آور چیزوں  کے استعمال سےمنسلک  بھولنے کامرض(Delirium): ",
      "normalText":
          " ذہنی الجھاؤ ، وہم ، تیزخیالات ، تشویش ،بے چینی ، ہوش و حواس کھوجانایا ماحول سے ناشناسی  ،  جو خصوصاStimulant یا شراب یا دیگر سکون آور اشیاءکو چھوڑنے سے وابستہ ہے ۔کیا شخص نشے کے زیر اثر یا بے ہوش دکھائی دیتا ہے؟(سکون یا  نیند کی حالت جو  sedativeکے استعمال کے نتیجے میں ہو )",
    },
  ];
}

class AppearanceDiagnosisText {
  static const String title =
      "نشہ کے استعمال سے ہونے والے امراض کی ظاہری نوعیت";
  static const String subTitle1 = 'رابطہ کی تعداد سے متعلق تجاویز';
  // ignore: constant_identifier_names
  static const List bullet_points = [
    {
      "text":
          'شراب یا دوسری نشہ آوراشیاء سے ظاہر ہونےوالی نشانیاں مثلا (شراب کی بو، غیر واضح گفتگو،  بے ہوشی کی حالت  ، بےترتیب  رویہ)'
    },
    {
      "text":
          'نشہ آوراشیا ء کے حالیہ استعمال کی نشانیاں (انجیکشن کے تازہ نشانات، جلد کا انفیکشن)'
    },
    {
      "text":
          'رویے میں شدید تبدیلی کی  نشانیاں  اور علامت، نشہ چھوڑنے یا طویل استعمال کے اثرات (باکس نمبر 1 دیکھیں)'
    },
    {
      "text":
          'سماجی کارکردگی میں خرابی (کام یا گھر میں مشکلات، بے ترتیب ظاہر ی حلیہ)'
    },
    {
      "text":
          'جگر کی دائمی بیماری کی علامات (جگر کے غیر معمولی انزائم)، یرقان  زردجلداورآنکھیں(پیلاہٹ)، جگر کی کی بیرونی سطح پرواضح نرمی  اور سوزش (جگر کی ابتدائی بیماری میں)،  فلوئیڈسے بھرا ہوا پیٹ ، سپائیڈر نئیوی (جلد کی سطح پر نظر آنے والی مکڑی کے جال  کی طرح کی خون کی رگیں) جگر کے شدید اور طویل مدتی  مرض کی وجہ سے ہونے والےدماغی امراض (ہیپاٹک انسیفالوپیتھی)'
    },
    {
      "text":
          'جسمانی توازن، چلنے پھرنے، اور  آنکھوں کی غیر ارادی تیزاور بار بار (Nystagmus) حرکات کے مسائل.'
    },
    {
      "text":
          'حادثاتی نتائج: خون کی شدید کمی (Macrocytic Anaemia) پلیٹلیٹس کی تعداد میں کمی ، خلیوں کا بڑھا ہوا حجم (MCV)'
    },
    {
      "text":
          'نشہ  آور اشیا ء چھوڑنےیا اس کے   زیادہ ا ستعمال یا شدیدنشے کی حا لت میں ایمرجنسی سروس میں آنا ۔ شخص نشے میں دھت ، حد سے زیادہ متحرک، مشتعل، بے چین یا الجھا ہوا نظر آ سکتا ہے۔'
    },
    {
      "text":
          'نشہ آور اشیاء کے چھوڑنے، اُس کے زیادہ استعمال یا شدیدنشہ کی حالت کی نظر آ سکتا ہے.'
    },
    {
      "text":
          "نشے کی بیماری میں مبتلا افراد نشہ آور اشیا ء کے استعمال سے ہونےوالےمسائل کے بارے میں نہیں  بتاتےمزید یہ کہ:",
      "sub_bullet_points": [
        "ادویات کے لیے بار بار درخواست کرنا جیساکہ سائیکو ایکٹیو ادویات.",
        "چوٹیں",
        "نس کے ذریعے  لی گئی منشیات  سے جڑے انفیکشن (ایچ آئی وی/ایڈز، ہیپاٹائٹس سی )",
      ]
    },
    {
      "text":
          'طبی مشورہ: صحت کی سہولیات طبی مراکز میں کام کرنے والے  تمامافراد سے تمبا کو اور شراب کے استعمال کے با رے میں پوچھنا  چاہئیے.'
    },
  ];
  // ignore: constant_identifier_names
  static const String button_text = 'آگے بڑھیے';
}

class PsychoactiveDiagnoseText {
  static const String title = 'باکس ۱: Psychoactive Substance';
  static const String subTitle =
      'رویوں پرشدید اثرات، نشہ چھوڑنے کے بعد کے  علامات ، اور طویل استعمال کے اثرات';

  static const List<Map<String, dynamic>> listPsychoactivItems = [
    {
      'title': 'شراب',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "دماغ کے حجم میں کمی،وقوفی صلاحیت میں کمی، فیصلہ کرنے کی صلاحیت میں کمی،  جسمانی توازن کا کھو جانا، جگر کاتناؤ، معدہ کا زخم، خون کی کمی، کچھ اقسام کے  کینسر کا خطرہ بڑھ جانا اور دیگر طبی مسائل",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "جھٹکے لگنا، لرزش، متلی یاالٹی، دل کی دھڑکن  اور بلڈ پریشر میں اضافہ ، دورے، غصیلہ رویہ، الجھن،  غیر حقیقی  تجربات (Hallucination) جان لیوا ہو سکتا ہے ۔",
          'boldText': 'جان لیوا ہو سکتی ہے۔'
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "سانس میں شراب کی بو، غیر واضح انداز میں گفتگو، بے ترتیب رویہ، اشتعال انگیزی، الٹی کرنا ، ڈگمگاتی ہوئی چال",
        },
      ],
    },
    {
      'title': 'Benzodiazepines',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "یادداشت کی کمزوری، بزرگ افراد میں گرنے کا خطرہ، مہلک  یا خطرناک sedative کی  زیادہ مقدارلینے کا خطرہ",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "تشویش/بے چینی، بے خوابی، رعشہ طاری ہو نا، لرزش، متلی/الٹی، دل کی دھڑکن  اور بلڈ پریشر میں اضافہ، دورے، اشتعال انگیزی، الجھن، غیر حقیقی تجربات/ ادرک ۔",
          'boldText': 'جان لیوا ہو سکتی ہے۔'
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "غیر واضح انداز  میں گفتگو، غیر مناسب رویہ، ، ڈگمگاتی ہوئی چال",
        },
      ],
    },
    {
      'title': '(Opioids)  اوپیا ئیڈز',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "قبض، مہلک سکون آورنشہ کی  زیادہ مقدارلینے کا خطرہ،  تناسلی غدود کی کمیhypogonadism، ریوارڈز ، سیکھنے اور ذہنی دباؤ کے ردعمل میں تبدیلی آنا",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "آنکھ کی پھیلی ہوئی پتلیاں ، تشویش ، متلی/الٹی،/دست ، پیٹ میں درد، پٹھوں میں درد، سر درد، آنکھوں سے آنسوآنا اور ناک کا بہنا، جمائی آنا،رونگٹے کھڑے ہونا، دل کی دھڑکن اور بلڈ پریشر میں اضافہ",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "آنکھ کی پتلیوں کا سکڑنا، غنودگی اوربیٹھے بیٹھے سوجانا، ماحول سے ناشناسی (ہوش وحواش میں کمی)، سست رفتار میں بول  چال",
        },
      ],
    },
    {
      'title': 'تمباکو',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "(تمباکو نوشی کرنے والوں میں) پھیپھڑوں کی بیماری ، دل کی بیماری، کینسر کا خطرہ اور صحت پر دیگر اثرات",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "چڑچڑاپن،نفرت آمیز خیالات (Hostility)، تشویش ، گھبراہٹ، مایوسی ، بے زاری،  دل کی دھڑکن اور بھوک میں اضافہ",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "بےقراری ،  تشویش اور بھوک میں کمی؛ stimulant کےاستعمال سے آنے والے اثرات جیسےتوجہ مرکوز کرنے، دھیان دینےاور یادداشت میں اضافہ",
        },
      ],
    },
    {
      'title': 'کوکین، میتھمفیٹامائنز، اور ایمفیٹامائنز کی طرح کے stimulants',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "ہائی بلڈ پریشر، دماغیوعصبی حادثات (CVAs) کا بڑھتا ہوا خطرہ، اریتھمیا، دل کی بے ترتیب دھڑکن، بے چینی، اداسی",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "تھکاوٹ، بھوک میں اضافہ، افسردگی، چڑچڑا مزاج خودکشی کے خیالات پر نظر رکھیں",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "آنکھ کی  پھیلی ہوئی پتلیاں،  بلڈ پریشر اور دل کی دھڑکن میں اضافہ، پرجوشی ، بہت زیادہ خوش ہونا، بہت زیادہ متحرک ہونا، بات چیت میں تیزی، تیز  خیالات، بے ترتیب سوچ، شکوک  و شبہات کا بڑھ جانا، غصیلہ ، بے ترتیب اور پرتشدد رویہ",
        },
      ],
    },
    {
      'title': 'کھات (Khat)',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "کھات استعمال کرنے والوں کا دن کا ایک اہم حصہ کھاٹ چبانے میں گزرنا۔ قبض، ذہنی صحت کے مسائل  مثال کے طور  پر سائیکوسس کا خطرہ",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText': "سستی،اداسی ، چڑچڑاپن",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText': "چوکس رہنا، بہت زیادہ خوشی، تھوڑا بہت پرجوش ہونا",
        },
      ],
    },
    {
      'title': 'بھنگ (Cannabis)',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "ذہنی صحت کے مسائل کا بڑھتا ہوا خطرہ جس میں بے چینی،شکوک   و شہبات اور سائیکوسس شامل ہیں،  موٹیویشن میں کمی، توجہ دینے میں مشکل، مایوکارڈیل انفیکشن،  رگوں کی تنگی کی وجہ سےدل کےدورے یا فالج کا خطرہ",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "اداس یا دھیمہ مزاج، تشویش، چڑچڑاپن، نیند میں خلل (ہوسکتاہے کوئی واضح علامات موجود نہ ہوں)",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "آنکھ کی پتلیاں نارمل ہونا،آنکھ کے پپوٹوں کی جھلیوں کی سوزش ، ردعمل  میں تاخیر ، بہت زیادہ خوشی محسوس کرنا، پر سکون ہونا",
        },
      ],
    },
    {
      'title': 'ٹراماڈول (Tramadol)',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "اوپیائیڈ پر انحصار، جھٹکوں کی بیماری کا خطرہ، نیند میں خلل",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "بنیادی طور پر اوپیائیڈ چھوڑنے کے اثرات اور کچھ سیر یٹونین نورا یپی نیفرین ری اپٹیک انہیبیٹر (SNRI) چھوڑنے کی علامات (اداس مزاج، سستی)",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "اوپیائیڈ کے  اثرات (سکون کی حالت میں ہونا ، بہت زیادہ خوشی وغیرہ) کے بعدstimulant کے اثرات (پرجوشی اور زیادہ مقدار لینے کی صورت میں جھٹکنے لگنا  )",
        },
      ],
    },
    {
      'title': 'ولوٹائل سولوینٹس (Volatile Solvents)',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "وقوفی  اعمال میں کمی ، ڈیلیریم، پیریفرل نیوروپیتھی، دیگر اعصابی مسائل کا بڑھ جاناجس سے اچانک موت واقع ہوسکتی ہے (Arrythmias)۔",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText': "جھٹکوں کی بیماری میں اضافے کا اندیشہ",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "چکر آنا، ہوش و حواس کھو جانا، حد سے زیادہ خوشی محسوس کرنا،چکر آنا ،  تندمزاجی، غیر حقیقی تجربات غیر حقیقی نظریات  ، عدم توازن، بصارت میں خلل، ذہنی دباؤ/ تشویش میں کمی، سکون  کی حالت  میں ہونا",
        },
      ],
    },
    {
      'title': 'ہلوسی نو جن (Hallucinogens)',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "شدید یا دائمی  سئیکوسس کی ا قساط(episode)،  نشے کے استمعال سے پر ہیز کےکا فی عرصے بعد اس کے اثرات کا تجربہ کرنا یا اس کی یاد آ نا",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText': "کوئی شواہد موجود نہیں ۔",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "دل کی دھڑکن، بلڈ پریشراور جسم کے درجہ حرارت میں اضافہ",
        },
      ],
    },
    {
      'title': 'ایم ڈی ایم اے (MDMA)',
      'buttons': [
        {
          'buttonText': "طویل استعمال کے اثرات",
          'displayText':
              "عصبی نَظَام  کے لیے نقصان دہ،  جوجسمانی اثرات اور رویوں پراثرات کاسبب بنے، ڈپریشن",
        },
        {
          'buttonText': "نشہ چھوڑنے کے بعد کے علامات",
          'displayText':
              "متلی، پٹھوں  میں اکڑاو، سر درد، بھوک میں کمی، دھندلا نظرآنا، خشک منہ، بے خوابی، افسردگی، بے چینی، تھکاوٹ، توجہ مرکوز کرنے میں دشواری",
        },
        {
          'buttonText': "رویوں پر شدید اثرات",
          'displayText':
              "خود اعتمادی، ہمدردی اور سمجھ میں اضافہ ، قربت کا احساس ہونا، بات چیت، خوشی محسوس کرنا  ، توانائی محسوس کرنا",
        },
      ],
    },
  ];
}

class FirstStageDiagnosisScreenTexts {
  static const String title =
      'مرحلہ1: نشہ آوراشیاء  کے استعمال کی تشخیص کریں۔';
  static const String subTitle1 =
      " کیا شخص  نشہ آوراشیاء کا  استعمال کرتا ہے؟";
  static const List bulletPoints1 = [
    'تمباکو، شراب، اور تجویز شدہ سائیکوایکٹیو  ادویات کے استعمال کے بارے میں پوچھیں۔',
    'صورتحال اور ظاہری  علامات کے لحاظ سے، بھنگ اور دیگر نشہ آوراشیاء کے استعمال کے بارے میں پوچھنے پر غور کریں۔'
  ];
  static const String subTitle2 = 'طبی مشورہ  -   ہسٹری لیتے وقت پوچھیں:';
  static const List bulletPoints2 = [
    'شخص نے نشہ کا استعمال کیسے شروع کیا؟',
    'انہوں نے  نشہ کا   استعمال کب شروع کیا؟',
    ' اس وقت ان کی زندگی میں کیا ہو رہا تھا؟',
    ' کیا   ان کے خاندانی یا سماجی حلقوں میں کوئی نشہ آور اشیاء استعمال کرتا ہے؟',
    'کیا انہوں نے اس کا استعمال کم کرنے کی کوشش کی ہے؟ کیوں؟ کیا ہوا؟',
  ];
  static const String diagnoseAdvice1 =
      'نشہ آوراشیاء   کا استعمال نہ کرنے سےصحت پر اسکےفوائد پر زور دیں۔';
  static const String diagnoseAdvice2 =
      'ہر استعمال شدہ نشہ کی مختلف درجوں  کے خطرات کے بارے میں  تعلیم (psychoeducation) فراہم کریں';
}

class SecondStageDiagnosisScreenTexts {
  static const String title =
      'مرحلہ2:  نقصان دہ  حد تک  نشہ آوراشیاء  کے استعمال کی تشخیص کریں۔';

  static const String subitle1 =
      'کیا نشہ نقصان دہ  حد تک استعمال  کیا جاتا ہے؟';
  static const String subitle2 = 'استعمال شدہ ہر نشہ کے لیے تشخیص:';
  static const String numberPoint1 = 'تعدد/کژت اور استعمال کی مقدار:';
  static const String numberPoint2 =
      'نقصان دہ رویے (اشارہ: پوچھیں "کیا  نشہ کا استعمال  آپ کےلیےمسائل کا باعث بنتا ہے؟"):';
  static const String number1Questions =
      '(اشارہ: پوچھیں "آپ اس نشہ کو ہفتے میں کتنے دن استعمال کرتے ہیں؟ آپ  دن میں کتنا استعمال کرتے ہیں؟") ہر استعمال کیے جانے والے نشہ آور شے کے لیےدرج ذیل جانچ کریں';
  static const List bulletPointsList = [
    'چوٹیں اور حادثات',
    'نشے کی حالت میں گاڑی چلانا',
    'منشیات کا انجیکشن، سوئیاں یا انجکشن شیر کرنا، سوئیاں دوبارہ استعمال کرنا',
    'استعمال کے نتیجے میں تعلقات کے مسائل ہو',
    'قانونی یا مالی مسائل',
    'نشے کی حالت میں جنسی سرگرمی میں مشفول ہونا جو خطرناک ہو  اور بعد میں اسکا پچھتاوا',
    'بچوں کی ذمہ داری سے دیکھ بھال کرنے میں ناقابلیت',
    ' تعلیم  اور     ملازمت میں خراب کارکردگی',
    'متوقع سماجی کردار میں خراب کارکردگی (مثلاً بچوں کی پرورش )',
  ];
}

class ThirdStageDiagnosisScreenTexts {
  static const String title = "مرحلہ 3:  نشہ آوراشیاء پر انحصار کی تشخیص ";
  static const String subTitle = ' کیا  منشیات پر انحصار کا امکان ہے؟';
  static const String subHeading1 =
      'ہراستعمال کیے جانے والےنشہ پر انحصار کی درج ذیل خصوصیات کے بارے میں پوچھیں:';
  static const String subHeading2 =
      'طبی مشورہ - نشہ کا اسطرح سے استعمال نشہ پر انحصار کی نشاندہی کرے جس میں شامل ہیں:';
  static const List bulletPointsList1 = [
    'زیادہ مقدار میں نشہ کا بار بار استعمال',
    'نشہ کے استعمال کی شدید خواہش یا مجبوری کا احساس',
    ' خطرات اور نقصان دہ نتائج کے باوجود اس نشہ کے استعمال میں خود کو منظم کرنے میں دشواری',
    'پہلے جیسے اثرات حاصل کرنے کے لیے استعمال کی حدمیں اضافہ (tolerance) اور روکنے کی  صورت میں نشہ چھوڑنے کی علامات',
  ];
  static const List bulletPointsList2 = [
    {
      'boldText': 'تمباکو:',
      'normalText': ' اکثر صبح سے شروع ہوکردن میں  کئ بار اسکا استعمال ۔ ',
    },
    {
      'boldText': 'شراب:',
      'normalText':
          'ایک وقت میں 6 سے زیادہ شراب کے گلاس، اور روزانہ استعمال کرنا ۔',
    },
    {
      'boldText': 'تجویز شدہ ادویات:',
      'normalText':
          'تجویز  شدہ ادویات  کی  تجویز کو گئ مقدار سے زیادہ خوراک لینا   اور نسخے کے لئے جھوٹ بولنا۔',
    },
    {
      'boldText': 'بھنگ:',
      'normalText': 'روزانہ کم از کم 1 گرام بھنگ۔',
    },
  ];
  static const String diagnoseAdvice1 = '  پروٹوکول نمبر1پر جایئں۔';
  static const String diagnoseAdvice2 = '  پروٹوکول نمبر 2پر جایئں۔';
}

class HomeAdministrativeSreenText {
  static const navigationText = " انتظامی اقدامات";
  static const title =  " انتظامی اقدامات (Management) ";
}

class SpecialPopulationScreenText {
  static const title = 'خصوصی پاپولیشن';
  // MedicalAdviceScreen
  static const population1Title =
      'طبی مشورہ: ایچ آئی وی/ٹی بی/ہیپاٹائٹس اور نشہ کا استعمال';
  static const popoulation1Heading = 'طبی مشورہ ';
  static const popoulation1SubHeading = 'رابطہ کی تعداد سے متعلق تجاویز';
  static const List<String> popoulation1BulletPoints = [
    'جو لوگ منشیات کا انجیکشن لگاتے ہیں ان میں ایچ آئی وی/ایڈز اور ہیپاٹائٹس کا خطرہ بڑھ جاتا ہے، خاص طور پر اگر وہ جراثیم سے پاک انجیکشن کا سامان استعمال نہیں کرتے یا منشیات کے بدلے میں غیر محفوظ جنسی تعلقات رکھتے ہیں۔ ایک بار متاثر ہونے کے بعد، ان کی بہتری کے امکانات کم ہو جاتے ہیں۔ ایچ آئی وی/ایڈز ٹی بی انفیکشن کے خطرے کو بھی بڑھاتا ہے، اور ایچ آئی وی ایڈز کے ساتھ رہنے والے لوگوں میں فعال ٹی بی کا ہونا موت کی بہت بڑی وجہ ہے۔ا ن افراد میں بھی ٹی بی کا خطرہ بڑھ جاتا ہے جو منشیات اور شراب کا بہت زیادہ استمعال کرتے ہیں۔ لہذا،یہ نوعیت ایسے شخص کی ہے جوان تمام منشیات کا استمعال ایک وقت میں کرتا ہو، خاص طور پر ہیروئین کا استمعال انجکشن کے زریعے اور اس کے ساتھ اسے ٹی بی، ایچ آئی وی /ایڈز، اور ہیپاٹائٹس کا ا نفیکشن۔',
    'منشیات اور شراب استعمال کرنے والوں کے علاج کی سہو لیات کو ایسے افراد جو انجکشن کے ذریعے منشیات کا استمعال کرتے ہیں ان افرادمیں ہیپاٹائٹس اور ایچ آئی وی کے با قائدہ طور پر ٹیسٹ کرنےچاہیے۔ اورانہیں کھانسی، بخار، رات کو پسینے آنا، یا وزن میں کمی کے ساتھ کسی شخص میں ٹی بی کا شبہ زیادہ کرنا چاہیے۔',
    'ایچ آئی وی/ایڈز اور ٹی بی کے علاج میں روزانہ ادویات لینے کی ضرورت ہوتی ہے، اور ہر دن اہم ہے۔ علاج کا براہ راست مشاہدہ علاج میں پابندی کو بہتر بنا سکتا ہے۔ اگر شخص اوپیائیڈ پر بھی انحصار کرتا ہے تو، اسی جگہ اور وقت پر روزانہ میتھاڈون یا بیوپرینورفائن کا علاج فراہم کرنے سے علاج کی پابندی میں مزید سہولت ہوگی۔',
    'ہیپاٹائٹس کا علاج روزانہ یا ہفتہ وار کیا جاتا ہے۔ ہیپاٹائٹس بی یا سی کے مریضوں کو شراب سے مکمل پرہیز کرنے کا مشورہ دینا چاہیے۔'
  ];
  // YoungPeopleAdviceScreen
  static const population2Title = '  نو عمر افراد (Adolescents) ';
  static const List population2ExpandableLists = [
    {
      'title': 'نو عمرافراد میں تشخیص کیسے کی  جائے؟',
      'listTexts': [
        'واضح کریں کہ صحت سے متعلق بات چیت کو رازداری میں رکھا جا ئیگا اور یہ کہ کن حالات میں نوعمرافراد کے والدین / دیکھ بھال کرنے والوں کو کچھ معلومات دی جائیں گی۔',
        ' پوچھیں کہ نو عمر فرد کی زندگی میں اور کیا ہو رہا ہے؟ نوعمر فرد  کے لیے سب سے اہم بنیادی مسائل کی نشاندہی کریں۔ اس بات کو ذہن میں رکھیں ہوسکتا ہے کہ نوعمر افراد اس بات کو صیح طریقے سے بیان نہ کر پا ئیں کہ انہیں کیا چیز پریشان کر رہی ہے۔',
        'تفصیلی سوالات درج ذیل معلومات حاصل کرنے میں مددگار ہو سکتے ہیں:جیسا کہ گھر، تعلیم اور روزگار، کھانا، پینا،  سرگرمیاں، منشیات اور شراب، جنسی کشش، تحفظ، اور خودکشی/ڈپریشن۔ بات چیت کے لیے کافی وقت دیں۔ دیگر ترجیحی ذہنی صحت کے مسائل کا بھی جائزہ لیں۔ اگر کسی ترجیحی مسئلے کی نشاندہی ہو جائے توریفر کریں۔'
      ],
    },
    {
      'title': 'نو عمر افراد کے لیےسائیکو ایجو کیشن',
      'listTexts': [
        'نوعمرافراد اور ان کے والدین کو انفرادی صحت اور سماجی کارکردگی پر شراب اور دیگر نشہ  کے اثرات کے بارے میں معلومات فراہم کریں۔',
        ' نوعمرفرد کے ماحول اور سرگرمیوں میں تبدیلی لانے کی حوصلہ افزائی کریں، بجائے اس کے کہ نوعمر کے رویے کو "مسئلہ"  کے طور پر توجہ مرکوز کریں۔ اسکول یا کام اور سرگرمی میں شرکت کی حوصلہ افزائی کریں جس سے نو عمر فرد مصروف ہو سکے۔محفوظ گروپی  سرگرمیوں میں شرکت کی حوصلہ افزائی کریں جس سے نوعمرافراد  کی صلاحتیں اجاگرکرنے  کی سہولت فراہم کریں اورکمیونٹی میں شمو لیت میں آسانی ہو۔ یہ ضروری ہے کہ نوجوان ان سرگرمیوں میں حصہ لیں جن میں ان کی دلچسپی ہو۔',
        ' والدین اور/یا دیکھ بھال کرنے والوں کو یہ جاننے کی ترغیب دیں کہ نوجوان کہاں ہے، وہ کس کے ساتھ ہے، وہ کیا کر رہے ہیں، وہ کب گھر ہوں گے، اور یہ توقع رکھیں کہ نوجوان اپنی سرگرمیوں کے لیے جوابدہ ہوگا۔'
      ],
    }
  ];
  // WomenAdviceScreen
  static const population3Title =
      'وہ خواتین جو بچے  پیدا کرنے کی عمر کی ہیں، حاملہ ہیں، یا دودھ پلانے والی ہیں';
  static const population3Screen1 = 'شراب کا استعمال';
  static const population3Screen2 = 'منشیات کا استعمال';

  // WomenAlcoholAdviceScreen
  static const List<Map<String, dynamic>> alcoholBulletPoints = [
    {
      'text':
          'وہ خواتین جو حاملہ ہیں یا حاملہ ہونے پر غور کر رہی ہیں انہیں شراب سے مکمل پرہیز کرنے پر مشورہ دیں۔',
      'topMargin': 20.0,
    },
    {
      'text':
          'خواتین کو مطلع کریں کہ حمل کے شروع میں تھوڑی مقدار میں بھی شراب پینا بڑھتے ہوئے فیٹس (fetus) کو نقصان پہنچا سکتا ہے، اور یہ کہ زیادہ مقدار میں شراب نشوونما کے شدید مسائل (فیٹل الکوحل سنڈروم) کا باعث بن سکتا ہے۔',
      'topMargin': 20.0,
    },
    {
      'text':
          'دودھ پلانے والی خواتین کو مشورہ دیں کہ وہ شراب سے مکمل پرہیز کریں۔',
      'topMargin': 20.0,
    },
    {
      'text':
          'خصوصی دودھ پلانے کے فوائد کے پیش نظر (خاص طور پر پہلے 6 مہینوں میں)، اگر مائیں شراب پیتی رہیں تو انہیں مشورہ دیا جانا چاہیے کہ وہ اپنے شراب کے استعمال کو محدود کریں، اور اپنے چھاتی کے دودھ میں شراب کی مقدار کو کم کریں، جیسے کہ شراب پینے سے پہلے دودھ پلانا اور دوبارہ اس وقت تک نہیں پلانا جب تک کہ خون میں اس کی مقدار صفر تک گر جائے (ہر پینے والے مشروبات کے لیے تقریباً 2 گھنٹے کی اجازت دی جائے، یعنی اگر دو مشروبات پیے جائیں تو 4 گھنٹے)، یا چھاتی کا دودھ پہلے سے نکال کر استعمال کیا جائے۔',
      'topMargin': 20.0,
    },
  ];

  static const warningText =
      'نقصان دہ نشہ  کا استعمال کرنے  والی تمام ماؤں اور چھوٹے بچوں کو ایسی سماجی معاونت کی خدمات پیش کی جائیں جو موجودہیں، جس میں بعد از پیدائش کے اضافی چیک اپ ، والدین کی  طر بیت اور طبی چیک اپ کے دوران بچوں کی دیکھ بھال شامل  ہے۔';

  // WomenDrugAdviceScreen
  static const womenDrugAbuseScreenTitle =
      'وہ خواتین جو بچے پیدا کرنے کی عمر کی ہیں، حاملہ ہیں، یا دودھ پلانے والی ہیں';

  static const drugsBulletPoints = [
    {
      'text':
          'خواتینکی  ماہواری کے بارے میں دریافت کریں اور اسے بتائیں کہ نشہ کا استعمال ماہواری میں مداخلت کرسکتا ہے، بعض اوقات یہ غلط تاثر دیتا ہے کہ حمل ممکن نہیں ہے۔',
      'topMargin': 15.0,
    },
    {
      'text':
          'فیٹس (fetus) کی نشوونما پر غیر قانونی ادویات کے مضر اثرات پر بات چیت کریں اور اس بات کو یقینی بنائیں کہ خواتین کو مؤثر مانع حمل ادویات تک رسائی حاصل ہو۔',
      'topMargin': 12.0,
    },
    {
      'text':
          ' حاملہ خواتین کو مشورہ دیں اور ان کی مدد کریں کہ وہ تمام غیر قانونی ادویات کا استعمال بند کر دیں۔ اوپیائیڈ پر انحصار کرنے والی حاملہ خواتین کو عام طور پر اوپیائیڈ ایگونسٹ جیسے میتھاڈون لینے کا مشورہ دیا جانا چاہیے۔',
      'topMargin': 15.0,
    },
    {
      'text':
          'نشہ کے مرض میں مبتلا ما وں کے بچوں کی نشہ   چھوڑنے  کی علامات کی  تشخیص (screening) کریں (جسے نوزائیدہ ابسٹیننس سنڈروم بھی کہا جاتا ہے)۔ زچگی میں اوپیائیڈ کے استعمال کی وجہ سے نوزائیدہ ابسٹیننس سنڈروم کا علاج اوپیا ئیڈز (جیسے مارفین) یا باربیٹیوریٹس کی کم مقدار سے کیا جانا چاہئے۔ مزید تفصیلات کے لیے براہ کرم حمل میں نشہ کے استعمال اور نشہ کے استعمال سے ہونے والے عارضوں کی شناخت اور اقدامات  کے لیے رہنما اصول ملاخطہ جو لنک پر موجود ہیں۔',
      'topMargin': 15.0,
    },
    {
      'text':
          'دودھ پلانے والی ماؤں کو مشورہ دیں اور ان کی مدد کریں کہ وہ کوئی بھی غیر قانونی ادویات استعمال نہ کریں۔',
      'topMargin': 15.0,
    },
    {
      'text':
          'نشہ  کے استعمال کی وجہ سے عارضے  میں مبتلا ماؤں کو کم از کم پہلے 6 ماہ تک خصوصی طور پر دودھ پلانے کے لیے مشورہ دیں اور ان کی مدد کریں، جب تک کہ ماہر سے مشورہ  نہ ملے۔',
      'topMargin': 15.0,
    },
  ];
}

class Protocol1AdministrativeSreenTexts {
  static const title = 'پروٹوکول 1: نقصان دہ حد تک استعمال';
  static const List<Map<String, dynamic>> navigationRows = [
    {
      'title': 'خصوصی پاپولیشن',
      'subText':
          'اگر وہ شخص نوجوان ہے یا  عورت ہے، حاملہ ہے یا دودھ پلا رہی ہے، تو خصوصی پاپولیشن والا سیکشن دیکھیں۔',
    },
    {
      'title': 'سائیکو ائجوکیشن Psychoeducation (2.1)',
      'subText':
          'سائیکو ائجوکیشن فراہم کریں اور اس بات پر زور دیں کہ نشہ کے  استعمال کا  درجہ/طریقہءکارصحت کو نقصان پہنچا رہا ہے۔',
    },
    {
      'title': 'موٹیوشنل انٹرویوں (2.2)',
      'subText':
          'نشہ کے استعمال کے لیے اس شخص کے  نشے کی خواہش کی حد  کو  دریافت  کریں۔ موٹیوشنل انٹرویوں منقد کریں۔',
    },
  ];

  static const List<Map<String, dynamic>> navigationStrategies = [
    {
      'title': 'استعمال کو کم کرنے یا روکنے کے لئے حکمت عملی (2.3)',
    },
    {
      'title': 'نقصان کو کم کرنے کی ترکیب (2.5)',
    },
  ];
  static const informationText1 =
      'نشہ کو مکمل طور پر روکنے یا غیر نقصان دہ درجہ تک استعمال کرنے کا مشورہ دیں، اگر کوئی ایک حالت موجود ہو۔  شخص کو  ایسا کرنے میں مدد فراہم کرنے کے لئے اپنا ارادہ زبانی طور پر بتائیں ۔ان سے پوچھیں کہ کیا وہ تبدیلی لانے کے لیے تیار ہیں ۔';
  static const informationText2 =
      'خوراک، رہائش، اور روزگار کی ضروریات کو مد نطر/ توجہ رکھیں۔';
}

class Protocol2AdministrativeSreenTexts {
  static const title = 'پروٹوکول 2: منشیات پر انحصار';
  // Protocol2OpoidsScreen
  static const opoidsTitle = 'اگر شخص  کا اوپیا ئیڈز پر انحصار ہے';
  static const opoidsSubTitle =
      'بحالی کا علاج عام طور پر نشہ کےاثرات کہ ختم کرنے سے زیادہ موثر ہوتا ہے۔  ';
  static const navigationRow1 = 'انحصار کی شدت کی جانچ کریں';
  static const List navigationRow1BulletPoints = [
    'اگر مناسب ہو تونشے کے جسم کے اثرات کو جسم سے ختم کرنے کے بعد شخص کواوپیائیڈ ایگونسٹ مینٹینس ٹریٹمنٹ(opioid agonist treatment)  جسے opioid substitution therapy بھی کہا جاتا ہے۔فراہم کریں۔',
    'پرٹوکول5: اوپیائیڈ ایگونسٹ مینٹینس ٹریٹمنٹ opioid  maintenance treatment پر جائیں۔'
  ];
  static const navigationRow2 =
      'بقیہ صورتوں میں، اگر ضروری ہو تو منصوبہ بندی کے ساتھ نشہ کے جسم سے اخراج کا بندوبست کریں';
  static const navigationRow2InfoText =
      'پروٹوکول 4 (اوپیائیڈ چھوڑنے کی علامات) پر جائیں۔';

// Protocol2BenzodiazepinesScreen
  static const benzoTitle = 'اگرشخص  کا بینزوڈیازپائنز پر انحصار ہے';
  static const benzoNavigationRow1 =
      'اچانک چھوڑنے سے جھٹکے لگنا اور بھولنے کی بیماری  ہو  سکتی ہے۔';
  static List benzoBulletPoints = [
    'زیر نگرانی ڈسپنسنگ کے ساتھ بینزودیازپائن کی خوراک کو آہستہ آہستہ  بتدریج کم کرنے یا داخل مریضوں  کےترتیب میں زیادہ تیزی سے اسکی کمی پر غور کریں۔',
    ' پروٹوکول 6 (بینزودیازپائن چھوڑنے کی علامات ) پر جائیں۔'
  ];

  //Protocol2AlcoholScreen
  static const alcoholTitle = 'اگراس  شخص کا شراب پر انحصار ہے';
  static const alcoholNavigationRow1 =
      'اچانک شراب چھوڑنے سے دورے اور بھولنے کی بیماری  ہو سکتی ہے۔';
  static const alcoholNavigationRow1BulletPoints = [
    'تاہم، اگر شخص شراب کا استعمال بند رضامندکرنے کے لیے تیار ہے، تو اس کو سہولت فراہم کریں۔',
    ' شراب کے استعمال کو روکنے کے لیے مناسب ترتیب کا تعین کریں، اور اگر ضروری ہو تو مریض  کو داخل کر کے نشہ کے جسم سے اخراج کا بندوبست کریں۔',
    ' پروٹوکول 3 (شراب کو چھوڑنے کی علامات) پر جائیں۔'
  ];
  static const alcoholInfoText1 =
      'روزانہ تھامین 100 ملی گرام تھایامین کی خوراک بند کے ذریعےلینے کا مشورہ دیں۔';
  static const alcoholNavigationRow2 =
      '» دوبارہ شراب پر انحصار سے بچنے کے لیے ادویات کے علاج پر غور کریں۔';
  static const alcoholNavigationRow2BulletPoints = [
    'ادویات میں شامل ہیں acamprosate، naltrexone اور disulfiram. ۔',
    ' بھی استعمال کیا جا سکتا ہے، تاہم، اس کے نشہ آور اثرات اور زیادہ مقدار میں استعمال کے خطرہ کی وجہ سے اسکا استعمال خصوصی ماحول میں بہترین ہے۔',
    'اگر مکمل پرہیز نہ ہو ان ادویات کے ساتھ، ایک مؤثر ردعمل میں شراب کے استعمال کی مقدار اور تعداد میں کمی شامل ہوسکتی ہے(abstinance)۔',
    'ٹیبل 1 پر جائیں۔',
  ];
  // Protocol2OtherScreen
  static const otherTitle = 'دیگر تمام نشہ اور ادویات کے لئیے';
  static const otherBasicGuideline =
      'نشہ کو مکمل طور پر روکنے کا مشورہ دیں اور ایسا کرنے میں اس شخص کو مدد فراہم کرنے کے اپنے ارادے کو زبانی طور پر بتائیں۔ ان سے پوچھیں کہ کیا وہ ایسا کرنے کے لیے تیار ہیں؟';
  static const otherNavigationRow1 =
      'استعمال کو کم کرنے یا روکنے کی  ترکیب عملی (2.3)';
  static const otherNavigationRow2 =
      'نقصان کو کم کرنے کی ترکیب کو دریافت کریں(2.5)';

  static const otherNavigationRow2Info = [
    'اگر موجود  ہوں تو ساتھیوں  پر مبنی مددفراہم کرنے والے rehab/residential گروپس    یا علاج کے لیے بحالی یا      ریزڈینشل کمیونیٹیز  کوریعز کرنے   پر غور کریں۔',
    'خوراک، رہائش، اور روزگار کی ضروریات کو پورا کریں۔',
    'اس کے ساتھ موجود کوئی اورجسمانی یا ذہنی امراض کی تشخیص کریں  اور علاج فراہم کریں ،  پرہیز کے 2-3 ہفتوں کے بعد، کیونکہ کچھ مسائل پرہیز سے حل ہو جائیں گے۔'
  ];

  // Protocol2AllScreen
  static const allCaseTitle = ' تمام صورتوں میں';
  static const allNavigationRow1 = 'سائکوائجوکئشن Psychoeducation فراہم کریں (2.1)';
  static const allNavigationRow1Info =
      'اگر ضروری ہو تو نشہ کے جسم سے اخراج کی خدمات کا بندوبست کریں یا  مریض کو داخل کرنے کی سہولت  جہاں دستیاب ہو وہاں علاج کریں۔ ضرورت کے مطابق نشہ چھوڑنے کی علامات کا علاج کریں۔';
  static const allNavigationRow2 =
      'نشے پر انحصار کے علاج میں شخصیت     motivational index کےذریعے شخص کی حوصلہ افزائی کے لیے مختصر علاج مہیا کریں ۔(2.2)';
  static const allNavigationRow2Info =
      'اگر ضروری ہو تو نشہ کے جسم سے اخراج کی خدمات کا بندوبست کریں یا  مریض کو داخل کرنے کی سہولت  جہاں دستیاب ہو وہاں علاج کریں۔ ضرورت کے مطابق نشہ چھوڑنے کی علامات کا علاج کریں۔';
  static const allNavigationRow2BulletPoints = [
    ' نشہ کے استعمال کی وجہ سے ہونے والی خرابیوں کے لیے ثبوت پر مبنی نفسیاتی علاج میں انفرادی اور گروہی پروگرام شامل ہیں جو 6-12 ہفتوں یا اس سے زیادہ عرصے تک چلائے جاتے ہیں، اور جو تکنیکوں کا استعمال کرتے ہیں جیسے کہ سوچ اور برتاؤکی تھراپی، تحریک دینے  والی تھراپی، ہنگامی انتظام کی تھراپی، کمیونٹی کو تقویت دینے کا طریقہ، اور فیملی تھراپی۔',
    ' شواہد پر مبنی سماجی مدد کے طریقوں میں ملازمت اور رہائش کی مدد شامل ہے۔'
  ];
}

class Protocol3AdministrativeSreenTexts {
  static const title = 'پروٹوکول 3: شراب چھوڑنے کے اثرات';
  static const informationTexts = [
    'جتنا ممکن ہو سکے،  خاموش اور پر سکون ماحول مہیا کریں؛ دن کے وقت روشن اور رات کے وقت اتنا روشن ہو کہ اگر شخص رات کے وقت جاگے تو گرنے سے بچ سکے',
    'یقینی بنائیں کہ کافی مقدار میں پانی  پلایا جارہا ہےاور الیکٹرولائٹ جیسےپوٹیشیم اور میگنیشیم کی مطلوبہ ضروریات پوری ہورہی ہیں۔  ',
    'پانی کی کمی کومدنظررکھیں : جسم میں پانی کی مقدار برقرار رکھیں۔ جس میں اگر ضرورت ہو تو نس کے ذریعے پانی کی مقدار کو پورا کریں۔ اور پانی پینے پر زور دیں۔ ورنکی انسیفالوپیتھی سےبچنے کے لیے گلوکوز سے پہلے تھایامین دینا یقینی بنائیں۔'
  ];

// Protocol3TreatmentDrugs
  static const treatmentDrugsTitle = 'ادویات سے علاج';
  static const treatmentDrugsInfo1 =
      'جب مناسب ہو، شراب چھوڑنے کی علامات کا علاج کریں۔ منصوبہ بندی سے  نشہ کے جسم سے اثرات ختم کرنے کی صورت میں،  نشہ چھوڑنے کی علامات سے بچنے کے لیے diazepam کا استعمال کریں۔ ڈائی زیپم کی خوراک اور استعمال کا دورانیہ نشہ چھوڑنے کی علامات کی شدت پر منحصر ہوتاہے۔';
  static const treatmentDrugsBulletPoints = [
    '3سے7 دن تک روزانہ  diazepamکی  ابتدائی خوراک ،40 ملی گرام ( 10 ملی گرام دن میں چار بار یا 20 ملی گرام دن میں دوبار) منہ کے ذریعے دیں۔جیسے  ہی علامات میں بہتری آئے اس کی  خوراک اور/یا تعدد کو آہستہ آہستہ کم کریں۔ اس شخص کو مسلسل نگرانی میں رکھیں ، کیونکہ ہر شخص اس دوا  پر مختلف  رد عمل  دے سکتا ہے۔',
    'ہسپتال میں، ڈائی زیپم  کثرت سے(مثلاً ہر گھنٹے کے بعد) اور روزانہ زیادہ مقدارمیں دی جا سکتی ہے، اگر ضرورت ہو تو  شخص کی ذہنی حالت اور نشہ چھوڑنے کی علامات کی تشخیص کی بنیاد پر  پہلے ۳ دن کے لیئے روزانہ diazepam  120ملی گرام منہ  کے ذریعے دیں۔',
    'جگر کے میٹابولزم میں خرابی والے افراد کو (جگر کی بیماری کی علامات والے افراد یا بزرگ افراد)، ابتدائی  طور پر منہ کے ذریعے 5سے-10 ملی گرام تک کی کم مقدار میں ایک ہی خوراک دیں کیوکہ ان پاپولیشن میں بن  نزوڈیازپائن اثر کا دورانیہ  زیادہ ہوسکتا ہے۔ اس کے  متبادل، ڈائی زیپم کی بجائے ایک  جلد اثرکرنے والی بینزوڈیازپائن جیسے آکسازپم oxazepamاستعمال کی جا سکتی ہے۔ ٹیبل1 دیکھیں۔'
  ];
  static const treatmentDrugsInfo2 =
      'جب مناسب ہو، شراب چھوڑنے کی علامات کا علاج کریں۔ منصوبہ بندی سے  نشہ کے جسم سے اثرات ختم کرنے کی صورت میں،  نشہ چھوڑنے کی علامات سے بچنے کے لیے diazepam کا استعمال کریں۔ ڈائی زیپم کی خوراک اور استعمال کا دورانیہ نشہ چھوڑنے کی علامات کی شدت پر منحصر ہوتاہے۔';

  // TabletsListScreen
  static const tabletListTitle = 'ٹیبل 1: ادویات کا چارٹ';

  static const List<Map<String, dynamic>> tabletsNavigationRows = [
    {
      'title': 'بینزوڈیازپائنز',
      'subText':
          ' شراب چھوڑنے کی علامات،سٹیمولنٹ (stimulant)کی شدید نشے اور سائیکوسز کے علاج کے لیے',
      'tablets': [
        {
          "name": "ڈایا زپام",
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  ' ان لوگوں میں استعمال نہ کریں جو نشہ کی حالت میں بے ہوش ہوں۔ دیگر سیڈیٹو (sedative) کے ساتھ ملا کر دینے سے احتیاط کریں۔ مریضوں کو گاڑی نہیں چلانی چاہیے۔ جگر کی شدید بیماری والے افراد میں اثر کی مدت طویل ہوسکتی ہے۔ ادویات کی فروخت کے خطرات کو کم کرنے کے لیے دوا کا استمعال اپنی نگرانی میں کروائیں۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'نشہ کی حالت میں بے ہوشی اور سانس لینے میں دشواری جان لیوا ہو سکتی ہے۔ طویل مدت تک استعمال انحصار کا باعث بن سکتا ہے۔',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  'شراب چھوڑنےیا سٹیمولنٹ (stimulant) کی شدید نشے سے نظر آنے والی علامات کے لیے 10سے 20ملی گرام ہر دو گھنٹے بعد جب تک شراب چھوڑنے یا سٹیمولنٹ (stimulant) کے شدید نشے کی نظر آنے والی علامات ختم نہ ہو جائیں اور شخص سکون کی حالت میں آ جائے۔ آؤٹ پیشنٹ سیٹنگ میں شراب چھوڑنے کی علامات کے لیے کم مقدار (دن میں 10 ملی گرام تک چار بار) کی خوراک دیں۔',
            },
          ]
        }
      ]
    },
    {
      'title': 'اوپیائیڈ انٹاگونسٹ',
      'subText': 'اوپیائیڈ کے زیادہ مقدار میں استعمال کے علاج کے لیے',
      'tablets': [
        {
          "name": 'نالوکسون',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText': 'کوئی معلومات موجود نہیں ۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText': 'تکلیف یا نشہ چھوڑنے کی علامات سامنے آسکتی ہیں۔',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  '0.4-2 ملی گرام اوپیائیڈ کے زیادہ استعمال کے علاج کے لیے نس، پٹھوں، ناک کے ذریعے یا جلد کے نیچے ضرورت کے مطابق خوراک دہرائیں',
            },
          ]
        }
      ]
    },
    {
      'title': 'وٹامنز',
      'subText': 'ورنکی انسیفالوپیتھی کو روکنے یا اس کا علاج کرنے کے لیے',
      'tablets': [
        {
          "name": 'تھایا مین (وٹامن بی-1)',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText': 'کوئی معلومات موجود نہیں ۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText': ' کوئی معلومات موجود نہیں ۔',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  'ورنکی انسیفالوپیتھی کو روکنے کے لیے 100 ملی گرام 5 دن تک دن میں 1 بار نس کے ذریعے ورنکی انسیفالوپیتھی کے علاج کے لیے 100-500 ملی گرام دن میں 2-3 بار نس یا پٹھوں کے ذریعہ 3-5 دن تک دیں۔',
            },
          ]
        }
      ]
    },
    {
      'title': 'اوپیائیڈ ایگونسٹ',
      'subText': 'اوپیائیڈ چھوڑنے کی علامات اور انحصار کے علاج کے لیے',
      'tablets': [
        {
          "name": 'میتھاڈون',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  'دل یا سانس کی بیماری والے مریضوں میں احتیاط کے ساتھ استعمال کریں۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'نشہ میں بے ہوشی، الجھن، متلی، قے، قبض، ممکنہ ہارمونل تبدیلیاں، کمزور جنسی خواہش میں کمی، ای سی جی تبدیلیاں جیسے (QT)انٹرول میں طویل وقفہ یا دل کی دھڑکن کم ہونا، بلڈ پریشر کم ہونا، سانس لینے میں دشواری۔',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  "اوپیائیڈ چھوڑنے کی علامات:میتھاڈونکی ابتدائی خوراک 20 ملی گرام، اگر ضروری ہو تو 4 گھنٹے بعد 5-10 ملی گرام کی اضافی خوراک کے ساتھ۔ اوپیائیڈ مینٹیننس:\nابتدائی خوراک 10-20 ملی گرام اگر ضرورت ہو تو اضافی خوراک 10 ملی گرام کے ساتھ، اگر ضرورت ہو تو روزانہ کی خوراک میں 5-10 ملی گرام مسلسل کچھ دنوں کے وقفے سے اضافی خوراک دیں۔دوا کی مقدار اس وقت تک برقرار رکھیں جب تک اوپیائیڈ ایگونسٹ کا علاج کو روکنے کی ضرورت نہ ہو۔",
            },
          ]
        },
        {
          "name": 'بیوپرنورفین',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  'دل کی بیماری، سانس کی بیماری، یا جگر کی بیماری میں احتیاط کے ساتھ استعمال کریں غلط استعمال کا امکان۔ - اچانک روکنے سے نشہ چھوڑنے کی علامات ظاہر ہو سکتی ہیں۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  ' نشہ میں بے ہوشی، چکر آنا، اٹیگزیا کی بیماری، متلی، قے، قبض، سانس لینے میں دشواری',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  '8 ملی گرام کی ابتدائی خوراک جو ضرورت کے مطابق ہر روز 4-8 ملی گرام تک بڑھائی جا سکتی ہے یاورکحیں کہ شخص کو اوپیائیڈ (opioid)چھوڑنے کی علامات ظاہر نہ ہو رہی ہوں اور وہ غیر قانونی اوپیائیڈ (opioid)کا استمعال نہ کر رہا ہو۔ اس وقت تک برقرار رکھیں جب تک کہ اوپیائیڈ ایگونسٹ کا علاج بند کرنے کے لیے تیار نہ ہوں۔',
            },
          ]
        },
        {
          "name": 'مورفین سلفیٹ',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  ' ان لوگوں میں استعمال نہ کریں جو نشہ کی حالت میں بے ہوش ہوں۔ دیگر سیڈیٹو (sedative) کے ساتھ ملا کر دینے سے احتیاط کریں۔ مریضوں کو گاڑی نہیں چلانی چاہیے۔ ڈائیورشن (یعنی کسی اور کو دوائی بیچنا) کے خطرے کو کم کرنے کے لیے خوراک کی نگرانی کریں، لمبے عرصے تک کام کرنے والی اوپیا ئیڈز، جیسے میتھاڈون یا بیوپرنورفین آوٹ پیشنٹس (out-patients)کودن میں ایک بار دیں ، اگردستیاب ہو۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'نشہ میں بے ہوشی اور سانس لینے میں دشواری جو جان لیوا ہو سکتا ہے۔ طویل استعمال انحصار کا باعث بن سکتا ہے۔',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  'اگر ضرورت ہو تو10-20 ملی گرام ابتدائی خوراک کے ساتھ 10 ملی گرام اضافی خوراک کے ساتھ',
            },
          ]
        }
      ]
    },
    {
      'title': 'الفا ایڈرینرجک',
      'subText': 'ایگونسٹ اوپیائیڈ اچھوڑنے کی علامات کے علاج کے لیے',
      'tablets': [
        {
          "name": 'کلونیڈائن',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  'دل کی، دماغی اور جگر کی بیماری میں احتیاط برتیں۔ گردے کی بیماری میں کم مقدار میں استعمال کریں۔ غلط استعمال کے امکانات سے آگاہ رہیں۔ اہم علامات کو قریب سے مانیٹر کریں۔ دوا کو اچانک نہ روکیں، کیونکہ نشہ چھوڑنا ہائی بلڈ پریشر کا سبب بن سکتا ہے۔ حاملہ یا دودھ پلانے والی خواتین اس سے پرہیز کریں',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'نشہ میں بے ہوشی، ہلکا پھلکا محسوس کرنا، چکر آنا، سر درد، متلی/الٹی، خشک منہ، قبض، جنسی کمزوری، ڈپریشن، بے چینی، کم بلڈ پریشر، دل کا تیزی سے دھڑکنا، دل کی آہستہ دھڑکن، اور اے وی بلاک',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  '0.1 ملی گرام روزانہ 2-3 بار دیں۔ نشہ چھوڑنے کی علامات کو کنٹرول کرنے کے لیے دوا کی خوراک کو تقسیم کر کے دیں ۔اس میں روزانہ 1 ملی گرام تک کا اضافہ کریں۔',
            },
          ]
        },
        {
          "name": 'لوفیکسیڈین',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  'دل، دماغی اور گردے کی بیماری میں احتیاط برتیں۔ طویل عرصے تک QT سنڈروم، میٹابولک خرابی، یا اگر وہ QT کو طول دینے والی کوئی دوسری دوائیں لے رہے ہیں تو ان سے پرہیز کریں۔ اہم علامات کو قریب سے مانیٹر کریں۔ دوا کو اچانک بند نہ کریں، کیونکہ نشہ چھوڑنا ہائی بلڈ پریشر کا سبب بن سکتا ہے۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'نشہ میں بے ہوشی، چکر آنا، کم بلڈ پریشر، ای سی جی تبدیلیاں جیسے QT میں طویلوقفہ یا دل کی دھڑکن کم ہونا',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  'لوفیکسیڈین 0.4 سے 0.6 ملی گرام دن میں دو بار شروع کریں۔ضرورت کے مطابق اس میں روزانہ 0.4-0.8 ملی گرام اضافہ کریں۔ زیادہ سے زیادہ ایک خوراک: 0.8 ملی گرام۔ روزانہ زیادہ سے زیادہ خوراک: 2.4 ملی گرام دوا کی خوراک کو 2 سے 4 خوراکوں میں تقسیم کر دیں۔',
            },
          ]
        },
      ]
    },
    {
      'title': 'شراب پر انحصار سے بچنے کے لیے ادویات',
      'subText': 'شراب پینے کی خواہش کو روکنے کے لیے',
      'tablets': [
        {
          "name": 'ایکیمپروسیٹ',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  'گردے کی بیماری میں، 333 ملی گرام سے کم خوراک منہ کے ذریعے دن میں 3 مرتبہ دیں ۔ Contraindication گردے کی شدید بیماری اور جگر کی بیماری میں مخالف علامات ظاہر کرنا',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'سہال، پیٹ پھولنا، متلی/الٹی، پیٹ میں درد، ڈپریشن، بے چینی، خودکشی، خارش۔ کبھی کبھار، میکیولو پاپولر ریش ہو سکتا ہے، اور شاذ و نادر، جلد پر پس والے چھالے (below skin reactions)',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  ' 333 ملی گرام کی 2 گولیاں 12 ماہ تک روزانہ 3 بار دینا شروع کریں اگر اس شخص کا وزن 60 کلو سے کم ہو تو 12 ماہ تک 2 گولیاں ہر دن 2 بار دیں۔',
            },
          ]
        },
        {
          "name": 'نالٹرکسون',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  'نالٹرکسون کی آخری خوراک کے 24 گھنٹے بعد اوپیا ئیڈز استعمال کرنے والے مریضوں میں مہلک اوور ڈوز کا خطرہ، مخالف اثرات کی وجہ سے جگر کی خرابی یا شدید ہیپاٹائٹس والے مریضوں میں استعمال نہ کریں۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'سیڈیشن (sedation)بے ہوشی، چکر آنا، متلی/الٹی، پیٹ میں درد، بے خوابی، بے چینی، توانائی میں کمی، جوڑوں اور پٹھوں میں درد۔ جگر کے زہریلے مادےکی وجہ سے جگر کے فنکشن(function) کی نگرانی کریں۔',
            },
            {
              'buttonText': 'مقدار',
              'displayText':
                  ' نالٹرکسون 6-12 ماہ تک روزانہ 50 ملی گرام شروع کریں۔ اوپیائیڈ پر انحصار میں، اس بات کو یقینی بنائیں کہ پچھلے 7 دنوں میں کوئی اوپیائیڈ استعمال نہیں ہوا ہے (مثال کے طور پر نالوکسون کی خوراک کے استعمال کے طور پر)',
            },
          ]
        },
        {
          "name": 'ڈسلفیرم',
          "buttons": [
            {
              'buttonText': 'احتیاطیں',
              'displayText':
                  ' Tricyclic antidepressants (TCAs)، monamine oxidase inhibitors (MAOIs)، antipsychotics، vasodilators، اور alpha یا beta adrenergic antagonists ڈسلفیرم شراب کے ردعمل کو زیادہ سنگین بنا دیتے ہیں۔ ڈسلفیرم لینے کے 6-14 دن بعد شراب کی حساسیت جاری رہتی ہے، چاہے تھوڑی مقدار میں ہو۔ شراب کے ساتھ استعمال نہ کریں، کیونکہ ردعمل جان لیوا یا مہلک ہو سکتا ہے۔ حاملہ یا دودھ پلانے والی خواتین میں استعمال نہ کریں۔ ہائی بلڈ پریشر، دل، جگر، یا گردے کی بیماری، دماغی ع حادثات، سائیکوسس، اضطراری (impulsivity)کیفیت، یا خودکشی کا خطرہ۔',
            },
            {
              'buttonText': 'منفی اثرات',
              'displayText':
                  'غنودگی، چکر آنا، سر درد، ٹھنڈے گرم، پسینہ آنا، خشک منہ، متلی/الٹی، کپکپاہٹ، بدن کی بدبو، جنسی کمزوری۔ شاذ و نادر، نفسیاتی رد عمل، الرجک ڈرمیٹیٹائٹس، پیریفرل نیورائٹس، یا ہیپاٹک سیل کا ضیا نقصان ہو سکتا ہے۔ شدید رد عمل الجھن، قلبی نظام کے رکنے اور موت کا باعث بن سکتا ہے',
            },
            {
              'buttonText': 'مقدار',
              'displayText': 'روزانہ 200-400 ملی گرام شروع کریں۔',
            },
          ]
        }
      ]
    }
  ];

  // Protocol3EncephalopathyScreen
  static const encephalopathTitle = 'ورنکی انسیفالوپیتھی کی روک تھام اور علاج';
  static const encephalopathSubTitle = 'پروٹوکول 3: شراب چھوڑنے کے اثرات';
  static const encephalopathBulletPoints = [
    'شراب کا بہت زیادہ  مقدار میں استعمال کرنے والوں کو ورنکی انسیفالوپیتھی  کا خطرہ ہے، جوتھامین کی کمی کا سنڈروم ہے جس کی خصوصیات  میں الجھاؤ، nystagmus آنکھوں کی غیر ارادی، تیز اور بار بار حرکت ،Ophthalmoplegia آنکھوں کی حرکت کو کنٹرول کرنے والے ایک یا زیادہ عضلات کی کمزوری/ فالج، Ataxia غیر مربوط حرکتیں کا خطرہ ہے۔',
    ' اس سنڈروم سے بچاوء کے لیے تمام افراد کو کو 100 ملی گرام تھیمائن  منہ کے ذریعے دینی چاہیئے جو طویل طرصے سے شراب کا مسلسل استعمال کرتے ہیں۔ ورنکی کا انسیفالوپیتھی کے خطرےسے بچاوء کے لیئے گلوکوز سے پہلے دینے سے پہلے تھایا مین دیں۔',
  ];

  // Protocol3Advice1Screen
  static const protocolAdviceTitle = 'طبی مشورہ';
  static const protocolAdvice1SubText =
      'منصوبہ بندی سے شراب کا استعمال روکنے کے لیئے ، شراب چھوڑنے سے ہونے والے شدید علامات کے خطرے کی جانچ کریں';
  static const protocolAdvice1InfoText1 =
      'منصوبہ بندی سے شراب کا استعمال روکنے کے لیئے ، شراب چھوڑنے سے ہونے والے شدید علامات کے خطرے کی جانچ کر یں۔  پوچھیں:';
  static const protocolAdvice1BulletPoints = [
    ' کیا ماضی میں نشہ چھوڑنے کی  شدیدعلامات سامنے آئی ہیں،  جس میں جھٹکے لگنا ، ڈیلیریم شامل ہیں۔',
    'کیا دیگر اہم طبی یا نفسیاتی مسائل  موجود ہیں؟',
    '  کیا ماضی میں او پی ڈی میںنشہ چھوڑنے  کی کوششیں ناکام ہوئیں؟',
    'کیا شخص بے گھر  یا کسیسماجی مددکے بغیر ہے؟',
  ];
  static const protocolAdvice1InfoText2 =
      'اگر خطرہ زیادہ ہے تو out patient detoxification  پر in patient detoxification  کو  ترجیح دی جایں۔ )بیرونی مریضوں میں نشہ کے جسم سے اخراج کے مقابلے میں داخل م بیرونی مریضوں میں نشہ کا جسم سے اخراج بہتر ہے۔';
  static const protocolAdvice2SubText =
      'کسی بھی نشہ کےچھوڑنے سے ہونے والی  علامات کے علاج  کے دوران لاگو ہونے والے بنیادی اصول';
  static const protocolAdvice2InfoText =
      'کسی بھی نشہ کےچھوڑنے سے ہونے والی  علامات کے علاج  کے دوران لاگو ہونے والے بنیادی اصول: ';
  static const protocolAdvice2BulletPoints = [
    ' ہائیڈریشن کو برقرار رکھیں۔',
    'نشہ  چھوڑنے سے ہونے والی مخصوص علامات کے ظاہر ہوتے ہی ان کا علا      ج  کریں، یعنی متلی کےعلاج  کے لئے اینٹی ایمیٹکس(anti-emetics)،  درد کے لئے  اینالجیسک(analgesics)،  اور بے خوابی کے لئے  سکون آور ادویات سے علاج کریں۔',
    'اگرشخص علاج کی سہولت چھوڑناچاہے  تو اسے ایسا کرنے کی  اجازت دیں ۔',
    'نشہ کے جسم سے اخراج  (detoxification)کےبعد علاج اور مدد فراہم کرنا جاری رکھیں۔',
    'ڈپریشن کی علامات شدید نشہے  کی حالت کےبعد کی مدت  میں ، نشہ چھوڑنے سے    ظاہر  ہونے   والی  علامات کے دوران یاوربعد میں ظاہر   ہو سکتی ہیں، اور یا  اس شخص میں  پہلے سے ڈپریشن موجود  ہو۔ خودکشی کے خطرے سے  الرٹ /با خبر رہیں۔  ',
    '» detoxification کی کامیابی  کے  بعد ان تمام افراد کو   مسلسل علاج، مدد اور نگرانی کی پیشکش کریں،   اس بات  سے فرق نہیں  پڑتا کہ detoxification کس جگہ یا   کہاں کی گئ  ۔',
  ];
}

class Protocol4AdministrativeSreenTexts {
  static const title = 'پروٹوکول 4: اوپیائیڈ (opioid) چھوڑنے کے اثرات';
  static const heading = 'پروٹوکول 4: اوپیائیڈ چھوڑناسے ظاہر ھونے والیعلامات';
  static const informationText =
      'اوپیا ئیڈزچھوڑنے  سے پہلے احتیاط کا مشورہ دیا جاتا ہے، خاص طور پر جب اسکا استعمال انجکشن کے زریعے کیا گیاہو۔ جب نشہ چھڑوانے کا فیصلہ کیا جائے، تو اس شخص کو اس سے ھونے والی علامات اور اس کے دورانیے سے اگاہ کیا جائے۔ مثالاً نشہ چھوڑنے  کے نتیجے میں اوپیا ئیڈز کی کم مقدار سے ہی اس کے اثرات ظاہر ھونے لگتے ہیں۔ اس کا مطلب یہ ہے کہ اگر کوئی شخص نشہ چھوڑنے  کے بعد معمول کےمطابق اوپیائیڈ کا دوبارہ استعمال شروع کرتا ہے تو اس سے اورڈوز overdose کا خطرہ بڑھ جاتا ہے۔ ان خطرات کی وجہ سے، بہتر ہے کہ نشہ سے ودڈرال withdrawalاس صورت میں کیا جائے جب بحالی کے رہائشی یا دوسرے نفسیاتی اور سماجی معاونت کے پروگرام میں داخلے کا منصوبہ plan ہو۔ دوسری صورت میں، شخص کو میتھیڈون یا بیوپرنوفین کے زریعے اوپیائیڈ سبسٹیٹیوشن تھراپی پر غور کیا جاسکتا ہے؛ اوپیوئیڈ ایگونسٹ مینٹیننس ٹریٹمنٹ سیکشن دیکھیں (پروٹوکول 5 دیکھیں)، اور علاج کے لیے درج ذیل فارماکلوجیکل آپشنز میں سے ایک کو منتخب کریں:';

  static const bulletPoints = [
    'بیوپرنورفین : بیوپرنورفین کو 3-14 دنوں کے لیے 4-16 ملی گرامفی دن کی خوراک زبان کے نیچے رکھ کر دی جاتی ہے۔ . بیوپرینورفائن سے علاج شروع کرنے سے پہلے، اوپیائیڈ چھوڑنے کی علامات ظاہر ہونے تک انتظار کرنا ضروری ہے - ہیروئن کی آخری خوراک کے کم از کم 8 گھنٹے بعد اور میتھاڈون کی آخری خوراک کے 24-48 گھنٹے بعد؛ ورنہ، اس بات کا خطرہ ہے کہ buprenorphine خود ہی نشہ چھوڑنے سے ہونے والی سنڈروم کی وجہ بنے گی۔ ان لوگوں کا خاص خیال رکھا جانا چاہیے جو سکون آور ادویات لے رہے ہوں۔',
    'میتھاڈون: ابتدائی  طور پر میتھاڈون 15-20 ملی گرام کی روزانہ زبان کے نیچے رکھ کر دی جاتی ہے، اگر ضروری ہو تو اسے روزانہ 30 ملی گرام تک بڑھا دیا جائے۔ پھر آہستہ آہستہ خوراک کو کم کیا جائے، اور 3 سے   10دن  کے اندر اسکی خوراک کو مکمل طور پر ختم یا بند کر دیا جائے ۔ جیسا کہ بیوپرنورفین  کی طرح یہاں بھی، ان لوگوں کا خاص خیال رکھا جائے  جو سکون آور دوایات لے رہے ہوں۔',
    'کلونیڈائن یا لوفیکسیڈائن: اگر اوپیائیڈ  سبسٹیٹیوشن تھراپی  کی ادویات موجودنہ ہوں ، تو اوپیائیڈ چھوڑنےکےکچھ علامات جیسا کہ hyperarousal  کو کلونیڈائن یا لوفیکسیڈائن سے کنٹرول کیا جا سکتا ہے۔ ان کی 0.1سے 0.15 ملی گرام تک کی خوراک شخص کی جسما نی وزن کے مطا بق روزانہ 3 بار منہ کے زریعے دی جاتی ہے۔ یہ سر چکرانے یا سکون کی کیفیت میں جانے کی وجہ بن سکتا ہے۔ بلڈ پریشر کو بار بار مانیٹر کریں۔ نشہ چھوڑنے  کی دوسرے علامات کا بھی علاج  کرناچاہیے، جیسے متلی کےلیے اینٹی ایمیٹکس، انلجیسکس (analgesics) درد کےلیے، اور بے خوابی  کے لئے سکون آور ادویات دیں۔',
    'مورفین سلفیٹ: ابتدائی  طور پر 10-20 ملی گرام دیں  یاگر ضرورت  ہو تو 10 ملی گرام کی اضافی خوراک دیں۔اس سے جان لیوا بے ہوشی یا دم گٹنے کا مسلہ بن سکتا ہے۔ طویل استمعال اس پر انحصار کا باعث بن سکتا ہے۔  مزید تفصیلات کے لیے ٹیبل 1 پر جائیں۔',
  ];
  static const buttonText = ' ٹیبل 1: ادویات کا چارٹ';
}

class Protocol5AdministrativeSreenTexts {
  static const title =
      'پروٹوکول 5:اوپیائیڈ  (opioid) ایگونسٹ کےذریعے مینٹی ننس تھراپی';
  static const heading = 'پروٹوکول 5: اوپیائیڈ ایگونسٹ منٹیننس ٹریٹمنٹ';

  static const bulletPoints = [
    ' اوپیائیڈ ایگونسٹ منٹیننس ٹریٹمنٹ کے لیے  با قا عدہ ایک مقررہ قومی فریم ورک  کی ضرورت  ہے۔  یہ زیادہ دورانیے  کے لیے مو ثر رہنے والے اوپیائیڈ ایگونسٹس (یا جزوی ایگونسٹ) جیسی خصوصیت رکھتا ہے، جیسے میتھاڈون یا بیوپرینورفائن، جو عام طور پر روزانہ،ڈاکٹر کے زیر نگرانی دیے جاتے ہیں۔ اس بات کے پختہ شواہد موجود ہیں کہ میتھاڈون یا بیوپرینورفائن کے ساتھ ایگونسٹ منٹیننس کا علاج مؤثر طریقے سے  غیر قانونی منشیات کے استعمال، ایچ آئی وی کے پھیلاؤ، اموات اور جرائم کو کم کرتا ہے، نیز جسمانی صحت، ذہنی صحت اور سماجی کارکردگی کو بہتر بناتا ہے۔',
    '  نگرانی: (اوپیائیڈ ایگونسٹ منٹیننس ٹریٹمنٹ )کے لیے استعمال ہونے والی ادویات کے غلط استعمال کا خطرہ رہتا ہے۔ اس لیےپروگرامز کو اسکے غلط استمعال کو محدود کرنے کے لیے مختلف طریقے استمعال  کرنے چاہیے۔ جس  میں  زیر نگرانیاس دوا کی خوراک دینا شامل ہے۔',
    '  نگرانی: (اوپیائیڈ ایگونسٹ منٹیننس ٹریٹمنٹ )کے لیے استعمال ہونے والی ادویات کے غلط استعمال کا خطرہ رہتا ہے۔ اس لیےپروگرامز کو اسکے غلط استمعال کو محدود کرنے کے لیے مختلف طریقے استمعال  کرنے چاہیے۔ جس  میں  زیر نگرانیاس دوا کی خوراک دینا شامل ہے۔',
  ];
  static const buttonText = ' ٹیبل 1: ادویات کا چارٹ';
}

class Protocol6AdministrativeSreenTexts {
  static const title = 'پروٹوکول 6:  بیینزوز(Benzos) چھوڑنے کے اثرات';
  static const heading = 'پروٹوکول 6:  بیینزوز(Benzos) چھوڑنے کے اثرات';

  static const bulletPoints = [
    ' بینزودیازپائن چھوڑنے کی علامات طویل دورانیے کےلیے موثر رہنے  والی بینزودیازپائن کی خوراک  کو بتدریج کم کرکے، 8-12 ہفتوں میں بالکل ختم کر دیا جاتا ہے ، اور نفسیاتی و سماجی مدد کے ساتھ مہیا  کیا جاتا ہے۔ زیادہ تیزی سے  کمی صرف اسی صورت میں ممکن ہے جب وہ شخص کسی ہسپتال یا ڈیٹوکسیفکیشن کی سہولت میں داخل ہو۔',
    ' اگر بینزودیازپائن چھوڑنے کی شدیداور  بے قابو  علامات یا اچانک یا منصوبہ بندی کے بغیر چھوڑنے کی وجہ سے سامنے  آتی ہیں، تو فوری طور پر کسی ماہریا وسائل رکھنے والےکسی شخص سے مشورہ کریں تاکہ بینزودیازپائن کی زیادہ مقدار سےعلاج شروع کیا جا   ۓ اور شخص کو ہسپتال میں داخل کیا جا سکے۔ نامعلوم مریضوں کو بغیر نگرانی کے بینزودیازپائنز دینے سے احتیاط کریں۔'
  ];
  static const buttonText = ' ٹیبل 1: ادویات کا چارٹ';
}

class PsychologicalSocialScreenTexts {
  static const title = 'نفسیاتی و سماجی طریقہ علاج';
}

class PsychologicalSocialEducationScreenTexts {
  static const navigationTitle = 'سائیکو ائجوکیشن Psychoeducation (2.1)';
  static const bulletPoints = [
    'نشہ کے استعمال کی وجہ سے ہونے والے عارضوں کا اکثر مؤثر طریقے سے علاج کیا جا سکتا ہے، اور لوگ بہتر ہو سکتے ہیں',
    'نشہ کے استعمال پر بات  کرنا بہت سے لوگوں کے لیے شرمندگی  کے احساسات کا با عث بن سکتا ہے۔ نشہ  کے استعمال کے بارے میں لوگوں سے بات کرتے وقت ہمیشہ ذاتی رائے  دینے سے گریز کریں۔ جب لوگ محسوس کرتے ہیں کہ ان کے بارے میں کوئی رائے قائم کی جا رہی  ہے ، تو ہو سکتا ہے کہ وہ  آپ سے کھل کر بات نا کریں ۔ کوشش کریں کہ کسی بھی جواب پر حیرت کا اظہار نہ کر یں۔',
    'اعتماد کے ساتھ بتا یٔیں کہ شراب کےخطرناک یا نقصان دہ استعمال کو روکنا یا کم کرنا ممکن ہے اور اگر وہ اس مسئلے پر مزید بات کرنا چاہتا ہے اس شخص کو واپس آنے کی ترغیب دیں۔',
    'یہ فیصلہ ان کا اپنا ہے تو شخص  کے لیے نشے کے استعمال کو کم کرنے یا روکنے میں کامیاب ہونے کا زیادہ امکان  ہے۔',
  ];
}

class PsychologicalSocialMotivationalScreenTexts {
  static const navigationTitle =
      '2.2: مو ٹیویشنل انٹرویو کے زریعے (مختصر علاج)';
  // PsychologicalSocialMotivationalIntroScreen
  static const introScreenTitle = 'تعارف';
  static const introBulletPoints = [
    'مو ٹیویشنل      انٹرویو کےزریعےمختصر علاج دینا نشہ کے استعمال پر ذاتی رائے قامٔ کیے بغیر بات چیت کرنے کا ایک طریقہ ہے۔ یہ شخص کو اپنے نشہ کے استعمال پر غور کرنے کی طرف راغب کرتا ہے۔ا س کے زریعے نشے کے استمعال کے خطرات یا نقصانات پر مختصر طور پر بات چیت کر سکتے ہیں۔ ایسے کئ سیشنز پر مشتمل طویل بات چیت کے طور پر بھی استمعال کیا جا سکتا ہے جو نشے کے   استمعال پر ا نحصار کو حل کرتی ہے ۔  اسے موٹیویشنل اینہانسمنٹ تھراپی(motivational enhancement therapy) کہا جاتا ہے۔',
    'اس پوری بات چیت  کے دوران  مو ٹیویشنل      انٹرویو  کے عمل کے تمام حصوں کو شامل کرنا ضروری ہے : یعنی  ہمدردی کا اظہار کرنا اور اعتماد کی فضا پیدا کرنا، جبکہ ان کے بیانیے میں تضادات کی نشاندہی کرنا، اور غلط عقائد کو چیلنج کرنا۔ شخص سے بحث کرنے سے گریز کریں۔ انہیں یہ محسوس کرنا چاہیے کہ پریکٹیشنر ان کی حمایت کرنے کے لیے موجود ہے نہ کہ ان پر تنقید کرنے کے لیے۔ اگر وہ شخص اس وقت نشہ  کے استعمال کو ختم کرنے کا عہد کرنے میں  مشکل محسوس کر رہا ہو، پوچھیں کہ ایسا کیوں ہے، بجائے اس کے کہ وہ اس  شخص کو مجبور کرے جس کی  وہ توقع کر رہا ہو۔'
  ];

// PsychologicalSocialMotivationalMoreInfoScreen
  static const moreInforTitle = 'مزید تفصیل سے بات چیت کی ٹکنیکس';
  static const moreInfoListTexts = [
    ' شخص کو اسکی ضرورت کے مطا بق نشے کے استعمال سے منسلک خطرات کے بارے  رائے(feedback) دیں،آیا  ان  کا نقصان دہ حد تک  استعمال یا اس پر انحصار ہے انھیں یا  دوسروں  کو  ہو سکتے ہیں ۔',
    'شخص  کو اپنے نشہ کے استعمال  اور اس کے علاج کے لیے مدد حاصل کرنے  یا نہ کرنے کے  انتخاب کی ذمہ داری لینے کی طرف راغب کر یں ، اور یہ کہ آیا اس کے استعمال کے لیے مدد لینا ہے یا نہیں۔ آپ  ان سے پوچھیں کہ وہ اپنے نشہ کے استعمال کے بارے میں کتنے فکر مند ہیں۔',
    'اس شخص سے اس کے نشہ کے استعمال کی وجوہات پوچھیں، جو کئ  مسائل کےرد عمل  کے طور پر جیسا کہ ذہنی مسائل یا مخصوص تنا و، اور نشہ کے استعمال سے محسوس کیے جانے والے فوائد، چاہے  وہ کچھ دورانیے  کے لیے  ہی کیوں نا ہوں۔',
    'ان کے نشہ  کے استعمال کے مثبت اور منفی دونوں نتائج کے بارے میں پوچھیں اور اگر ضرورت ہو توبڑھا چڑھا کر فوائد  یا کم  بیان کئے  گئے خطرات/نقصانات کو چیلنج کریں۔',
    'اس شخص کے ذاتی مقاصد  کے بارے میں پوچھیں، اور آیا ان کے نشہ کا استعمال ان کی مدد کر رہا ہے یا انہیں ان مقاصد تک پہنچنے سے روک رہا ہے یا نہیں۔',
    ' اس شخص کے ساتھ اس کے نشہ کے استعمال، اس کے وجوہات ، نتائج اور ان کے ذاتی مقاصد کے بارے میں بیانات کی بنیاد پر بات چیت کریں، جس سے نشہ کے استعمال کے نتائج اور اس شخص کے بیان کردہ مقاصد کے درمیان واضح تضادات کو تلاش کیا جائے۔',
    ' حقیقت پر مبنی  مقاصد کے انتخاب کی بنیاد پر تبدیلی کے اختیارات پر تبادلہ خیال کریں اور باہمی طور پر متفقہ لائحہ عمل بنانے کی کوشش کریں۔',
    ' اس شخص کی زندگی میں مثبت تبدیلیاں لانے کے لیے اس پر اپنا اعتماد ظاہر کرتے ہوئے ان تبدیلیوں کو نافذ کرنے میں مدد کریں، ضرورت کے مطابق اگلے اقدامات کے بارے میں معلومات فراہم کر کے (مزید جائزہ، جسم سے نشہ کا اخراج ، سماجی و نفسیاتی مدد)، اور اگر موجود ہو تو اس شخص کو گھر ساتھ  لے جانے کے لیےہوم ورک کی چیزیں فراہم کریں ۔',
  ];
  // PsychologicalSocialMotivationalMoreQuesScreen
  static const moreQuesTitle = 'پوچھنے کے لیے سوالات کی مثالیں';
  static const moreQuesInfoText =
      'ذاتی رائے قائم کئےبنا مندرجہ ذیل سوالات پوچھ کر اس شخص سے ان کے نشہ کے استعمال کے بارے میں ان کے اپنے خیالات جانیں:';
  static const moreQueslistTexts = [
    ' نشہ کے استعمال کی وجوہات۔ (پوچھیں: "کیا آپ نے کبھی اس بارے میں سوچا ہے کہ آپ [نشہ آور اشیا   ٔ] کیوں استعمال کرتے ہیں؟")',
    ' ان کے خیال میں نشہ کے استعمال کے فوائدکیا ہیں ؟۔ (پوچھیں: "[نشہ]کے استمعال سے کیا ہوتا ہے ؟ کیا یہ آپ کے لیے مسا ئل کا با  عث بنتا ہے ؟")',
    ' ان کے خیال میں نشہ کے استعمال سے  ہونے والے اصل اور ممکنہ نقصانات  کیا ہیں۔ (پوچھیں: "کیا [نشہ] کے استعمال نے آپ کو کوئی نقصان پہنچایا ہے؟ کیا اسں سے مستقبل میں نقصان پہنچ سکتا ہے؟")',
    'اس شخص کے لیے سب سے اہم کیا ہے؟ (پوچھیں : "آپ کی زندگی میں آپ کے لیے سب سے اہم کیا ہے؟")',
  ];
}

class PsychologicalSocialPlanningScreenTexts {
  static String navigationTitle =
      '2.3 : نشہ کے استعمال کو کم کرنے یا روکنے کے لئے حکمت عملی';
  static String title = 'نفسیاتی و سماجی طریقہ علاج';
  static String subHeading =
      'تمام نشہ آور اشیا  کے استعمال کو کم کرنے یا روکنے کے مراحل:';
  static const bulletPointList = [
    'اگر کوئی شخص اپنے نشہ کے استعمال کو کم کرنے میں دلچسپی رکھتا ہے تو ان کے ساتھ درج ذیل مراحل پر بات  چیت کریں۔',
    'استعمال کا سبب بننے والی چیزوں اور ان سے بچنے کے طریقوں کی نشان دہی کریں۔ مثال کے طور پر: وہ جگہیں جہاں لوگ شراب پیتے ہیں یا ایسی جگہیں جہاں سےشخص منشیات حاصل کرتا ہے، وغیرہ۔',
    'استعمال کی جذباتی وجوہات اور ان سے نمٹنے کے طریقوں (یعنی تعلقات کے مسائل، کام میں مشکلات وغیرہ) کی شناخت کریں۔',
    'اس شخص کی حوصلہ افزائی کریں کہ  وہ نشہ آور اشیا گھر میں نہ رکھے۔'
  ];
}

class PsychologicalSocialSupportGroupsScreenText {
  static const navigationTitle = '2.4 : باہمی مدد کے گروپس';
  static const title = 'نفسیاتی و سماجی طریقہ علاج';
  static const informationText =
      ' نشہ آور اشیا کے مرض میں مبتلا افراد کے لیے باہمی مدد کے گروپس جیسے کہ الکوحلکس اینانومس، نارکوٹکس اینانومس، یا سمارٹ ریکوری مددگار زرا ئع ہو سکتے ہیں۔ وہ ایک غیر جانبدارماحول میں معلومات، ساختی سرگرمیاں اور باہمی مدد فراہم کرتے ہیں ۔ معلوم کریں باہمی مدد کے کون سےگروپ موجود ہیں۔';
}

class PsychologicalSocialStrategiesScreenText {
  static const navigationTitle =
      '2.5 : منشیات کے استعمال سے ہونے والےنقصان کو روکنے اور متعلقہ مسائل کے  علاج کی حکمت عملی';
  static const title = 'نفسیاتی و سماجی طریقہ علاج';
  static const supportHeading =
      'سرپرست / دیکھ بھال کرنے والوں کی معاونت/سپورٹ: ';

  static List<Map<String, dynamic>> expandableTexts = [
    {
      'title': 'شخص کی حوصلہ افزائی کریں کہ وہ خطرناک سرگرمیوں میں شامل نہ ہو',
      'listTexts': [
        'نشہ کی حالت میں گاڑی نہ چلانے کی نصیحت کریں۔',
        'اگرشخص اوپیا ئیڈز استعمال کرتا ہے، تو خاندان کے افراد کو پٹھوں یا ناک کے ذریعے دینے کے لیے نالوکسون فراہم کریں، جسے وہ اپنے پاس رکھ سکتے ہیں، تا کہ ضرورت سے زیادہ مقدار میں نشہ لینے کی صورت میں ہسپتال لے جاتے ہوئےیا مدد کا انتظار کرتے ہوئے اسکا تو وہ اس کو دی جا سکے۔',
      ],
    },
    {
      'title': 'ا گر وہ شخص انجیکشن لگاتا ہے',
      'listTexts': [
        'اس شخص کو نس کے ذریعے منشیات کے استعمال کے خطرات کے بارے میں آگاہ کریں، جس میں شامل ہیں: ایچ آئی وی/ ایڈز، ہیپاٹائٹس بی اور سی، جلد کے انفیکشن جو سیپٹیسیمیا (خون میں جراثیم شامل ہونا)، اینڈو کارڈائٹس (دل کی اندرونی لائنوں میں انفیکشن)، ریڑھ کی ہڈی کےزخم، گردن توڑ بخار،یہاں تک کہ موت کا سبب بن سکتے ہیں۔',
        'اس بات کو مدنظر رکھتے ہوئے کہ وہ شخص فوری طور پر منشیات کا انجیکشن لگانا بند نہیں کر سکتا، انجیکشن لگانے کی کم خطرناک تکنیک کے بارے میں معلومات فراہم کریں۔ جراثیم سے پاک سوئیوں اور سرنجوں کو ہر بار انجیکشن لگانے پر استعمال کرنے کی اہمیت پر زور دیں اور انجیکشن لگانے والے آلات کو دوسروں کے ساتھ شیئر نہ کریں۔',
        'Needle and syringeپروگرام تک رسا ئی کے لیے معلومات فراہم کریں کہ جہاں یہ موجود ہیں یا جراثیم سے پاک انجیکشن کے آلات کے دیگر ذرائع سے آگاہ کر یں ۔',
        'ایچ آئی وی/ایڈز اور ہیپاٹائٹس بی اور سی سمیت خون سے پیدا ہونے والی وائرل بیماریوں کے لیے کم از کم سالانہ ٹیسٹنگ کی ترغیب دیں اور پیشکش کریں۔',
        'ہیپاٹائٹس بی کی ویکسینیشن کی ترغیب کریں',
        'کنڈوم کی دستیابی کو یقینی بنائیں',
        'ایچ آئی وی/ایڈز اور ہیپاٹائٹس والے لوگوں کے علاج کی دستیابی کو یقینی بنائیں۔',
      ],
    },
    {
      'title': 'نشے کے امراض کے ساتھ مو جود دیگر امراض کا علاج',
      'listTexts': [
        'نشہ کے باعث ہونے والے امراض کے ساتھ افراد میں TB کے امکانات کی تشخیص کریں۔',
        'جنسی طور پر منتقل ہونے والی بیماریوں کی تحقیقات اور علاج پر غور کریں۔',
      ],
    },
  ];
}

class PsychologicalSocialCareerSupportScreenText {
  static const navigationText = '2.6 : کیئرر معاونت/ سپورٹ';
  static const title = 'نفسیاتی و سماجی طریقہ علاج';
  static const headingText = 'سرپرست / دیکھ بھال کرنے والوں کی معاونت/سپورٹ: ';
  static const bulletPointList = [
    "شخص کے  گھر والوں کے ساتھ نشہ کے مرض سے خاندان اور بچوں پر ہونے والے اثرات کے بارے میں بات چیت کریں۔",
    "شہ  کے استعمال کی وجہ سے ہونے والے امراض کے بارے میں معلومات اور تعلیم فراہم کریں۔",
    "ان کی ذاتی، سماجی اور ذہنی ضروریات کی تشخیص کے لیے  پیش کش کریں۔ کسی بھی ترجیحی ذہنی صحت کے مسائل کا علاج پیش کش کریں۔",
    "خاندان والوں  ا ور دیکھ بھال کرنے والوں کو  دیگر سماجی وسائل کے بارے میں مطلع کریں (اگر موجود ہوں) اور سپورٹ گروپس تک رسائی میں ان کی مدد کریں۔",
  ];
}
